# Pandas

## Task 1

You should import the necessary libraries. You will use `numpy` and `pandas` libraries.


> Don't forget to import `numpy`, and `pandas` in short form.

In [1]:
import numpy as np
import pandas as pd

## Task 2

Create a `DataFrame` from the given dictionary `data`.

In [2]:
data = {
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
}

df = pd.DataFrame(data)
df

    Name  Age         City
0   John   16     New York
1  Emily   28  Los Angeles
2   Ryan   22      Chicago

## Task 3

In this task you should complete the following steps:

### Task 3.1
Display all data for `Age` column for the DataFrame you created in the previous task.

In [3]:
df["Age"]

0    16
1    28
2    22
Name: Age, dtype: int64

### Task 3.2

Add `Salary` column to the `DataFrame` with the values `[50000, 60000, 45000]`.

In [6]:
df["Salary"] = pd.Series([50000, 60000, 45000]) 
df

    Name  Age         City  Salary
0   John   16     New York   50000
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

### Task 3.3

Filter the `DataFrame` to show only the rows with the `Age` greater than 18.

In [7]:
df[df["Age"] > 18]

    Name  Age         City  Salary
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

## Task 4

In this task you should complete the following steps:

### Task 4.1

Add new calculated field `Birth year`;

In [13]:
df["Birth year"] = 2025 - df["Age"]
df

    Name  Age         City  Salary  Birth year
0   John   16     New York   50000        2009
1  Emily   28  Los Angeles   60000        1997
2   Ryan   22      Chicago   45000        2003

### Task 4.2

Add new calculated field `Average age`.

In [17]:
df["Average age"] = df["Age"].mean()
df

    Name  Age         City  Salary  Birth year  Average age
0   John   16     New York   50000        2009         22.0
1  Emily   28  Los Angeles   60000        1997         22.0
2   Ryan   22      Chicago   45000        2003         22.0

### Task 4.3

Calculate absolute difference between `Age` and `Average age`.

In [20]:
(df["Age"] - df["Average age"]).abs()

0    6.0
1    6.0
2    0.0
dtype: float64

## Task 5

Complete the following tasks described below.

### Task 5.1

You have two dictionaries `data1` and `data2`. Create two `DataFrame` objects from these dictionaries. Then, `concatenate`, and `merge` these two `DataFrame` objects into one `DataFrame` object, and see the difference.

In [24]:
# Data
data1 = {'Name': ['John', 'Emily', 'Ryan'],
         'Age': [25, 28, 22]}
data2 = {'Name': ['Emily', 'Ryan', 'Mike'],
         'City': ['Los Angeles', 'Chicago', 'Houston']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

    Name  Age
0   John   25
1  Emily   28
2   Ryan   22

In [32]:
pd.merge(df1, df2, on="Name", how="outer")

    Name   Age         City
0  Emily  28.0  Los Angeles
1   John  25.0          NaN
2   Mike   NaN      Houston
3   Ryan  22.0      Chicago

In [31]:
pd.concat([df1, df2], ignore_index=True)

    Name   Age         City
0   John  25.0          NaN
1  Emily  28.0          NaN
2   Ryan  22.0          NaN
3  Emily   NaN  Los Angeles
4   Ryan   NaN      Chicago
5   Mike   NaN      Houston

### Task 5.2

You have two `Series` objects `s1` and `s2`. Make default mathematical operations on these two `Series` objects. Such as `+`, `-`, `*`, `/`, `**`, `//`, `%`. Also, filter `s1` and print only even numbers, and `s2` only with odd numbers.

In [34]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

In [35]:
s1 + s2 # use + operator here

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [37]:
s2 - s1  # use - operator here

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [38]:
s1 * s2  # use * operator here

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [39]:
s2 / s1  # use / operator here

0    6.000000
1    3.500000
2    2.666667
3    2.250000
4    2.000000
dtype: float64

In [40]:
s2 ** s1  # use ** operator here

0         6
1        49
2       512
3      6561
4    100000
dtype: int64

In [41]:
s2 // s1  # use // operator here

0    6
1    3
2    2
3    2
4    2
dtype: int64

In [42]:
s2 % s1  # use % operator here

0    0
1    1
2    2
3    1
4    0
dtype: int64

In [44]:
s2[s2 % 2 != 0]  # filter s1 here

1    7
3    9
dtype: int64

In [ ]:
# filter s2 here

### Task 5.3

You have a `Serias` object `s`. Make the following operations on this `Series` object:

* make all words in uppercase without loops;
* get length of each word without loops.

In [57]:
s = pd.Series(["numpy", "pandas", "matplotlib"])

In [62]:
s.astype(str).str.upper() # make all words in uppercase

0         NUMPY
1        PANDAS
2    MATPLOTLIB
dtype: object

In [63]:
s.astype(str).str.len()  # get length of each word

0     5
1     6
2    10
dtype: int64

## Task 6 Optional

You have a large dataset consisting of a series of numbers. Your task is to calculate the moving average of the series using a window of `5` elements. The moving average is the average of a set of consecutive values in the series, where the window `slides` through the series to compute the average at each position. The goal is to calculate the moving average efficiently and accurately. Also, compare time performance of Python and Pandas solutions.

> Please, note: If you get `nan` while calculating the moving average, you should remove it from the result. Pandas solution should take 1-2 lines of code.

### Python Solution

In the Python solution, a large dataset is generated using random numbers. The moving average is computed by iterating over the dataset using a loop. At each position, a window of 5 elements is created, and the average is calculated by summing the values in the window and dividing by 5.

In [83]:
import random


# Generate a large dataset
data = [random.randint(1, 100) for _ in range(10000000)] 


def unknown_signature(data: list) -> list:
    # Calculate the moving average with a window of 5
    moving_averages = []
    for i in range(4, len(data)):
        window = data[i - 4 : i + 1]
        average = sum(window) / 5
        moving_averages.append(average)
    return moving_averages[:10]

%time unknown_signature(data)

CPU times: total: 3.02 s
Wall time: 3.03 s

[32.2, 21.6, 22.8, 32.2, 29.4, 29.0, 28.8, 47.2, 55.2, 52.4]

### Solution using Pandas and Numpy

In [86]:
sr = pd.Series(data, dtype="float32")
%time res = sr.rolling(window=5).mean().dropna().tolist()
res[:10]

CPU times: total: 609 ms
Wall time: 652 ms

[32.2, 21.6, 22.8, 32.2, 29.4, 29.0, 28.8, 47.2, 55.2, 52.4]